-- phpMyAdmin SQL Dump
-- version 4.6.4
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: 2018-09-10 07:26:35
-- 服务器版本： 5.7.14
-- PHP Version: 5.6.25

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `test`
--

-- --------------------------------------------------------

--
-- 表的结构 `panda`
--

CREATE TABLE `panda` (
  `id` int(10) NOT NULL COMMENT 'id主键',
  `type` int(10) NOT NULL COMMENT '类型',
  `longitude` double NOT NULL COMMENT '经度',
  `latitude` double NOT NULL COMMENT '纬度',
  `park` varchar(20) NOT NULL COMMENT '公园名称',
  `details` varchar(100) NOT NULL COMMENT '大熊猫详情'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `panda`
--

INSERT INTO `panda` (`id`, `type`, `longitude`, `latitude`, `park`, `details`) VALUES
(1, 1, 112.00419044049, 34.965567270514, '洛阳龙潭大峡谷(已认领 助理)', '小乔(雌)、思一(雄)'),
(2, 1, 121.6135109213, 38.875179274812, '大连森林动物园', '金虎(雄)、飞云(雌)、妙音(雌)'),
(3, 1, 113.9725374775, 22.598835077823, '深圳野生动物园', '秋浜(雄)、园舟(雄)'),
(4, 1, 106.68927730603, 26.859564517901, '贵州森林野生动物园(已认领 助理)', '和琪(雌)、和美(雌)'),
(5, 1, 108.86898862425, 34.050288261303, '西安秦岭野生动物园', '秦秦(雌)、明明(雌)'),
(6, 1, 114.30159161271, 38.058900294662, '石家庄动物园', '娅祥(雄)、云子(雄)'),
(7, 1, 109.89057436566, 39.839178452093, '鄂尔多斯野生动物园', '七巧(雌)、七喜(雌)'),
(8, 1, 125.65321821332, 43.538020232025, '长春东北虎园', '牧云(雄)、初心(雌)'),
(9, 1, 128.47638511931, 44.793797983735, '亚布力熊猫馆', '思嘉(雌)、佑佑(雄)'),
(10, 1, 102.79661632919, 25.094612838894, '云南野生动物园', '毛竹(雄)、珍多(雄)'),
(11, 1, 109.40337814067, 24.263242783963, '柳州市动物园', '明浜(雄)、蜀琳(雄)'),
(12, 1, 116.88885450023, 38.265967503504, '沧州狮城动物大世界', '晶运(雄)、小妮(雌)'),
(13, 1, 118.24202219426, 39.676922555877, '唐山动物园(已认领)', '梅浜(雌)、双喜(雌)'),
(14, 1, 117.16542814705, 39.081884645308, '天津动物园(已认领)', '喜乐'),
(15, 1, 117.16542814705, 39.081884645308, '光合谷动物园', '巧巧(雄)、星美(雌)'),
(16, 1, 106.69258702768, 26.59782307171, '贵阳黔灵山公园', '海浜(雄)、星宝(雄)'),
(17, 1, 111.62023567537, 40.879795938214, '呼和浩特大青山野生动物园', '茜茜(雌)、仨(雌)'),
(18, 1, 107.54319879359, 33.588843056263, '长青华阳景区熊猫园', '雪雪(雌)'),
(19, 1, 113.3053263752, 23.140913427786, '广州动物园', '星一(雄)、雅一(雌)'),
(20, 1, 118.61359127242, 25.097831238519, '泉州海丝野生动物园', '星语(雌)、星愿(雄)'),
(21, 1, 118.05042272756, 24.588430719007, '厦门灵玲国际马戏城', '思念(雄)、思筠筠(雄)'),
(22, 1, 120.23725437645, 31.583467397863, '无锡动物园(已认领 助理) ', '缘大(乐山)(雄)'),
(23, 1, 120.70092917603, 33.246504839042, '盐城市大丰港动物园', '卯卯(龙升)(雄)、酉酉(清风)(雄)'),
(24, 1, 119.52259207294, 31.16942349771, '常州溧阳市天目湖南山竹海', '星安(雌)、华丽(雌)'),
(25, 1, 119.52259207294, 31.16942349771, '江苏淹城野生动物世界', '琪琪(雌)、成小(雄)'),
(26, 1, 120.35981438786, 31.324195767313, '苏州太湖国家湿地公园', '竹韵(雌)、新月(雌)'),
(27, 1, 118.80298355167, 32.091897622441, '南京红山森林动物园', '平平(雄)、和和(雌)、九九(雌)'),
(28, 1, 118.99095263241, 33.605252559969, '淮安市动物园', '隆浜(雄)、阿宝(雄)'),
(29, 1, 117.16747737699, 31.835304607264, '合肥野生动物园(已认领)', '亮亮(雄)'),
(30, 1, 117.13911702016, 33.662086188007, '宿州野生动物园', '大双(雌)、优浜(雌)'),
(31, 1, 116.98625512386, 36.699377518172, '济南动物园', '福虎(雄)(2018年5月回中心)、雅吉(雄)'),
(32, 1, 117.46330265656, 36.614860496587, '济南野生动物园', '娅双(雌)、二喜(雄)'),
(33, 1, 118.54390261962, 34.985945239515, '临沂动植物园', '憨憨(雄)、团子(雌)'),
(34, 1, 117.89649949748, 36.45035996788, '淄博原山如月湖湿地公园', '暂无(珍大(雄)、双儿(雄)于2018年5月离开,现居东莞)'),
(35, 1, 120.34999683488, 36.069514153114, '青岛动物园(已认领 助理) ', '缘小(雄)、贝贝(雌)'),
(36, 1, 116.35813961309, 37.38695936117, '德州动植物园', '月亮(雌)、贤贤(雌) '),
(37, 1, 122.1842983847, 37.501989183199, '威海刘公岛国家森林公园', '竹灵(雌)、宁宁(雄)'),
(38, 1, 122.63274184541, 37.416628681533, '威海西霞口野生动物园', '仙子(雄)、晶晶(雄)'),
(39, 1, 117.11097742777, 36.067223281423, '泰安泰山花海熊猫岛', '希望(雄)、武俊(雄)'),
(40, 1, 120.49433648308, 37.679245746344, '烟台龙口市动植物园', '朝阳(雄)、青山(雄)'),
(41, 1, 112.58397132487, 37.910714353873, '太原动物园', '暂无(贡贡(雄)、舜舜(雄)于2018年5月返回中心)'),
(42, 1, 115.87745521181, 28.632341528634, '南昌新动物园(已认领)', '美灵(雄)'),
(43, 1, 114.97214876164, 25.838017087146, '赣州森林动物园', '暂无(汉媛(雌)于2018年5月回中心)'),
(44, 1, 110.3811008464, 31.436535915433, '神农架熊猫馆', '韵韵(雌)、奥运(雄)'),
(45, 1, 114.24261058055, 30.542385978871, '武汉动物园', '伟伟(雄)(已经于2018年6月回中心)'),
(46, 1, 121.36063907248, 31.19547543198, '上海动物园(已认领)', '星二(雄)、雅二(雄)'),
(47, 1, 120.13315842888, 30.212466566155, '杭州动物园', '成就(雄)、双好(雄)'),
(48, 1, 119.98557688236, 30.154340774156, '杭州野生动物世界', '丽丽(雌)、山虎(雄)'),
(49, 1, 120.62468788833, 27.996881328789, '温州动物园(已认领)', '娅光(雄)、绩优(雄)'),
(50, 1, 121.67440020281, 29.803851448998, '宁波雅戈尔动物园', '阿杰(雌)、雅郡(雌)'),
(51, 1, 121.44214149114, 28.436012637112, '台州温岭长屿硐天', '欢欢(雄)、姚欣(雌)'),
(52, 1, 120.03008549278, 30.517233382191, '德清下渚湖熊猫乐园', '耀耀(雌)、运运(雄)'),
(53, 1, 102.88422674234, 30.568168414387, '雅安市宝兴县熊猫文化宣传教育中心', '星睿(雄)'),
(54, 1, 105.95956562581, 31.565799442289, '阆中熊猫乐园', '福龙(雄)、辉辉(雌)'),
(55, 1, 106.78291978742, 30.387935491749, '广安华蓥山大熊猫野化放归培训基地', '淘淘(思嘉哥哥 非野放大熊猫)(雄)、云涛(雄)'),
(56, 1, 103.53938087729, 29.597316661355, '峨眉山仙芝竹尖生态园熊猫馆', '芦琳(雄)、冰晶(雌)、春俏(雌)'),
(57, 1, 103.83200155066, 29.812894837498, '眉山青神熊猫馆', '华荣(雄)、苏星(雄)'),
(58, 1, 113.85151796185, 22.995958177715, '东莞香市动物园', '珍大(雄)、双儿(雄)'),
(59, 2, 119.28417201873, 26.088874101035, '福州熊猫世界乐园', '雷雷(雌)、龙飞(雄)、林阳(雄)、小双(雄)、娇小(雄)'),
(60, 2, 115.40142137263, 38.827063875317, '保定农业生态园-爱保中华大熊猫苑', '安安(雄)、雄雄(雄)、雅美(雌)、文慧(雌)'),
(61, 2, 123.68415639698, 41.929470491464, '沈阳森林动物园', '浦浦(雄)、发发(雄)、冰清(雌)、冰华(雌)'),
(62, 2, 113.00413487545, 28.033139296093, '长沙生态动物园', '君君(雌)、真真(雌)、成双(雄)、成对(雄)'),
(63, 2, 119.66087781864, 30.591256286047, '湖州安吉竹博园', '小娇(雄)、庆仔(雄)、珍巧(雌)、珍好(雄)'),
(64, 2, 104.10672060452, 30.707443287523, '成都动物园', '娅娅(雌)、莉莉(雌)、冰点(雄)、囡囡(雌)'),
(65, 3, 116.33893504741, 39.939662312222, '北京动物园(有所有权)(已认领)', '乐乐(雌)、大地(雄)、吉妮(雌)、古古(雄)、福禄(雌)、萌大(雄)、萌小(雄)、点点(雌)、萌兰(雄)'),
(66, 3, 121.72337898585, 31.052911889443, '上海野生动物园(已认领)', '雅奥(雄)、思雪(雌)、芊芊(雌)、月月(雄)、半半(雌)、雪宝(雄)、芊金(雌)'),
(67, 3, 113.31521028692, 23.00203923663, '广州长隆野生动物世界(已认领 助理)', '梅清(雌)、菊笑(雌)、美生(雄)、友友(雄)、婷婷(雌)、银柯(雄)、隆隆(雌)、萌萌(雌)、帅帅(雄)、酷酷(雄)、悦悦(雌)、亲亲(雄)、爱爱(雄)、隆仔(雄)、婷仔(雄)'),
(68, 3, 106.5058743168, 29.503930205373, '重庆动物园(有所有权)(已认领)', '新星(雌)、灵灵(雄)、娅老二(雌)、亮亮(雄)、兰香(雌)、友友(雌)、莽仔(雌)、好奇(雌)丁丁(雌)、渝宝(雄)渝贝(雌)、良月(雌)');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `panda`
--
ALTER TABLE `panda`
  ADD PRIMARY KEY (`id`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `panda`
--
ALTER TABLE `panda`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT COMMENT 'id主键', AUTO_INCREMENT=69;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
